FY-Project/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|* OpenFOAM for Windows 18.02 (v1)                                           *|
|* Built by CFD Support, www.cfdsupport.com (based on Symscape).             *|
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       159250;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       159400;
    }
    topAndBottom
    {
        type            patch;
        nFaces          650;
        startFace       159600;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       160250;
    }
    frontandback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       160750;
    }
)

// ************************************************************************* //
