FY-Project/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      dynamicMotionSolverFvMesh;

motionSolverLibs ("libsixDoFRigidBodyMotion.so");

motionSolver    sixDoFRigidBodyMotion;



patches         (airfoil);
innerDistance   1;
outerDistance   2;

mass            13.6;
centreOfMass    (0.4016 0.001 0.001);
momentOfInertia (0 2.176 2.176);
orientations
(
    
    1 0 0
    0 1 0
    0 0 1
);
angularMomentum (0 8.8 0);
g               (0 0 -9.81);
rho             rhoInf;
rhoInf          1.225;
report          on;


 solver
 {
     type    symplectic;
 }


constraints
{
    point
    {
        sixDoFRigidBodyMotionConstraint point;
        centreOfRotation    (0.25 0 0);
        
    }

    yAxis
    {
        sixDoFRigidBodyMotionConstraint axis;
        axis                (0 1 0);
    }
}

restraints
{
    verticalSpring
    {
        sixDoFRigidBodyMotionRestraint linearSpring;

        anchor          (0.25 0 0);
        refAttachmentPt (0.25 0 0);
        stiffness       1600;
        damping         0;
        restLength      0;
    }

    axialSpring
    {
        sixDoFRigidBodyMotionRestraint linearAxialAngularSpring;

        axis            (0 1 0);
        stiffness       200;
        damping         0;
         
    
    }
}


// ************************************************************************* //
